<template>
   <div :class="['flex','flex-column','justify-between',{hello:true,paddingBottom:isIphoneX}]" >

     <div class="cont  flex1 "  >

                   	<h1 style="font-size: .586667rem;margin:0 auto;width:100%;text-align:center;">糖吧APP用户协议及隐私条款</h1>

<dt  class="dt"><b>1、服务条款的确认和接受</b></dt>
<p>（1）糖吧APP（以下简称“糖吧”）的所有权、运作权以及其他一切权利归杭州变啦网络科技有限公司（以下简称：变啦或变啦科技）所有。用户在注册时，接受本协议并点击"确定"按钮完成注册，这表示用户与杭州变啦网络科技有限公司达成协议并接受所有的服务条款及隐私条款，具有合同效力。所以，为了保护您的合法权益，请您以最大谨慎态度认真阅读、充分理解本服务协议，如果有任何不清楚之处请联系我们，我们将向您详细说明。</p>
<p>（2）特别提醒，您点击同意本服务条款，即视为您确认自己已具有与享受本站提供的服务相对应的权利能力和行为能力，并能够独立承担法律责任。请您务必审慎阅读、充分理解各条款内容，特别是以黑体加粗形式提示您注意的条款。</p>
<p>（3）本平台的软件著作权及APP上发布的所有信息与内容的版权均受中华人民共国著作权法（含相关法律、法规）乃至世界版权法律的保护，仅供用户因自身学习、调研等目的免费使用。严禁未经授权对本APP上的任何内容进行复制、发行、出租、展览、放映、广播、修改、演绎、翻译、汇编、改编或逆向工程。杭州变啦网络科技有限公司保留所有未在本服务条款中明确授予的权利。
</p>
<dt class="dt"><b>2、服务简介</b></dt>
<p>（1）变啦运用自己的服务系统通过糖吧APP平台为用户提供各项服务，原则上相关服务是免费的，但用户必须自行承担其为连接至糖吧APP提供的服务器或其他设备而产生的费用；同时，用户也应对选购的相关付费服务或产品承担相应的费用。用户同意：</p>
<p>a、提供及时、详尽及准确的个人资料。</p>
<p>b、不断更新注册资料，符合及时、详尽准确的要求。</p>
<p>c、用户提供的性别、身高、年龄等个人资料及其他必要记录信息，将用于糖吧为用户提供的血糖测量服务。</p>
<b>d、变啦保留随时变更、中断或终止部分或全部网络服务的权利。</b>
<p>（2）用户隐私制度：尊重用户个人隐私是变啦的基本制度，因此未经用户授权变啦不会向第三方透露用户的注册资料及用户因享受糖吧APP服务而产生的任何信息，但以下情形除外：</p>
<p>a、用户要求变啦或授权某人通过电子邮件服务或其他方式透露这些信息。</p>
<p>b、变啦可能聘请外部公司或个人代表我们提供某些产品或服务，包括但不限于，提供运营、维护、IT平台和/或技术服务、数据安全或备份服务、发送信函或电子邮件、清除用户名单中的重复信息、分析数据、提供市场营销帮助、提供搜索结果和链接。在该等情况下，变啦可能会共享用户信息。</p>
<p>c、相应的法律、法规、政府机关要求及程序服务需要变啦提供用户的个人资料。</p>
<b>（3）如果用户提供的资料不准确、不真实、不合法有效，变啦保留结束用户使用糖吧APP各项服务的权利。</b>
<p>（4）用户在享用糖吧APP服务的同时，同意接受糖吧提供的各类信息服务；如果您对糖吧APP服务不满意，可以选择退订。</p>

<dt class="dt"><b>3、使用规则</b></dt>
<p>（1）用户在申请使用糖吧APP提供的服务时，应向变啦提供准确的个人资料，如个人资料有任何变动，应及时更新。</p>
<p>（2）用户在使用糖吧APP服务过程中，应遵循以下原则：</p>
<p>a、遵守中国有关的法律和法规；</p>
<p>b、不得为任何非法目的而使用糖吧APP提供的服务；</p>
<p>c、遵守所有与服务有关的网络协议、规定和程序；</p>
<p>d、不得利用糖吧APP提供的服务进行任何可能对互联网的正常运转造成不利影响的行为；</p>
<p>e、不得利用糖吧APP提供的服务传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；</p>
<p>f、不得利用糖吧APP提供的服务进行任何不利于变啦的行为；</p>
<p>g、不得利用糖吧APP的任何资源做出任何变啦未同意的宣传行为、广告行为、促销行为以及其他具有商业性质的行为。</p>

<dt class="dt"><b>4、服务条款的修改</b></dt>
<b>变啦有权不时对本服务服务条款进行修改，服务条款一旦发生变动，变啦将在糖吧APP平台统一公示相关修改内容。如果您不接受修改，请您及时注销您的账号；如果您继续使用糖吧APP的服务，则视为您同意变啦对服务条款的修改。</b>
<b>服务条款一旦发生变动，用户要继续使用糖吧APP各项服务需要确认如下两方面内容：</b>
<b>（1）确认糖吧APP服务条款及其变动。</b>
<b>（2）同意接受所有的服务条款限制。</b>

<dt class="dt"><b>5、用户的帐号、密码和安全性</b></dt>
<b>（1）一旦注册成功成为糖吧APP的用户，用户将得到一个帐号并设置对应的密码，请您妥善保护自己的密码，勿将密码告诉第三人，因密码保管不善而造成的损失由您自行承担；如果用户未保管好自己的帐号和密码而对用户、变啦或第三方造成的损害，除非用户能够证明变啦存在过错，否则用户应承担全部责任。</b>
<b>（2）用户应对基于其帐户发生的所有活动和事件负全部责任。用户可随时改变用户昵称、密码和头像，也可以结束旧的帐户重开一个新帐户，不论如何，变啦强烈推荐用户定期地修改密码以保证帐户安全性。</b>
<b>（3）用户同意若发现任何非法使用用户帐号或安全漏洞的情况，立即通告变啦。</b>

<dt class="dt"><b>6、未经变啦同意禁止进行商业性行为</b></dt>
<p>用户承诺，未经变啦书面同意，不得在糖吧APP或相关网站上进行销售或其他商业性行为。用户违反此约定，变啦有权删除该用户，并可根据违约行为的严重程度，限制相关用户账号的使用或者注销相关用户账号，并可依法追究其违约责任，由此给变啦造成损失的，变啦有权进行追偿。</p>

<dt class="dt"><b>7、信息的储存及利益保障</b></dt>
<b>（1）糖吧APP不对用户所发布信息的删除或储存失败负责，因此如果对于用户非常重要的信息，用户应预先在自己控制的存储设备上保存该等信息。</b>
<b>（2）用户同意保障和维护变啦全体成员的利益，用户负责支付由用户使用超出服务范围引起的费用，以及违反服务条款的损害补偿费用。</b>

<dt class="dt"><b>8、结束服务</b></dt>
<p>用户或变啦可随时根据实际情况中断服务。变啦不需对任何个人或第三方随时中断的服务而负责。用户若反对任何服务条款的建议或对后来的条款修改有异议，或对糖吧APP服务不满，用户只拥有以下权利：</p>

<p>（1）不再使用糖吧APP服务。</p>
<p>（2）通知变啦停止该用户的服务。</p>
<b>结束用户服务后，用户使用糖吧APP服务的权利马上终止。从结束用户服务后，变啦不再对用户承担任何义务。</b>
<b>再次重申，结束用户服务后，变啦亦不再对结束用户服务之前的任何事件承担责任。</b>

<dt class="dt"><b>9、通告</b></dt>
<p>所有发给用户的通告都可通过公告、电子邮件或常规的信件传送。变啦会通过邮件服务发送消息给用户，告诉他们服务条款的修改、服务变更、或其它重要事情。</p>
<b>一旦通过变啦一贯使用的技术手段将该等通知发送出去，除非有明确的、可以被证明的信息表明该等通知被退回，否则视为从发出该等通知的24小时内用户已经收到该等通知，且对于紧急通知视为从发出该紧急通知的30分钟内用户已经收到该等通知。如果因为用户更改注册信息或者提供虚假信息或者提供的注册信息未及时更新导致该等通知被退回，则视为用户已经收到该等通知并应由用户承担相应的责任。</b>


<dt class="dt"><b>10、知识产权</b></dt>
<b>（1）用户保证和声明对其所提供的作品拥有完整的合法的著作权和使用权，保证变啦在糖吧APP上使用该作品不违反国家的法律法规，也不侵犯第三方的合法权益或承担任何义务。用户应对其所提供作品因形式、内容及授权的不完善、不合法所造成的一切后果承担完全责任。</b>
<b>（2）用户同意变啦在糖吧APP上对其上传作品在全世界范围内享有免费的、永久性的、不可撤消的、独家的和完全的许可使用和再许可的权利。此许可和再许可权利包括但不限于此作品的著作权、邻接权及获得利益等权利。变啦保留对糖吧APP所有内容进行实时监控的权利，并有权依其自主判断对任何违反本协议约定的作品实施删除。变啦对于删除用户作品引起的任何后果或导致用户的任何损失不负任何责任。</b>
<b>（3）用户同意变啦可以对用户上传到糖吧APP上的作品或其它知识产权进行整理、汇编，且相关汇编权利归变啦所有。若变啦需要使用该等汇编作品获其它知识产权的，则变啦不须征得用户同意且用户放弃向变啦主张权利的权利。</b>
<b>（4）因用户作品的违法或侵害第三人的合法权益而导致变啦或其关联公司对第三方承担任何性质的赔偿、补偿或罚款而遭受损失（直接的、间接的、偶然的、惩罚性的和继发的损失），用户对于变啦或其关联公司蒙受的上述损失承担全面的赔偿责任。</b>
<b>（5）一旦变啦发现第三方擅自使用用户的知识产权、肖像权或其它权利的，则变啦可以在通知用户3个工作日后自行或代表用户开展维权工作，该等维权工作包括但不限于：发函（包括律师函）、诉讼或提出其它要求。用户不得以任何方式阻挠变啦的维权工作。如果因为用户的故意行为妨碍变啦维权工作的，则用户应承担变啦因此发生的维权工作费用，包括但不限于调查取证的费用、差旅费用、律师费用、诉讼费用。</b>

<dt class="dt"><b>11、言论</b></dt>
<p>用户承诺发表言论要：爱国、守法、自律、真实、文明。不传输任何非法的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、危害国家安全的、泄露国家机密的、破坏国家宗教政策和民族团结的以及其它违反法律法规及政策的内容。若用户的行为不符合以上提到的服务条款，变啦将作出独立判断立即取消用户服务帐号。用户需对自己在网上的行为承担法律责任。</p>
<dt><b>12、免责与赔偿声明</b></dt>
<b>（1）糖吧APP配套血糖仪由非医疗机构提供，糖吧APP不保证为用户所提供的医学信息的完全可靠性，所有医学知识最终以专业医生指导建议为准，由此产生的风险糖吧不承担任何责任。</b>
<b>（2）糖吧APP及配套血糖仪不能用于糖尿病的诊断和筛查，不能用于其它与糖代谢紊乱有关的葡萄糖检测，亦不能作为糖尿病诊断的依据。使用糖吧APP及配套血糖仪监测血糖时，请严格按照使用说明书所要求的操作程序和操作条件进行。用户不按照标准的操作程序进行检测而产生的一切风险，由用户自行承担。</b>
<b>（3）用户明确同意其使用糖吧APP服务所存在的风险将完全由其自己承担；因其使用糖吧APP服务而产生的一切后果也由其自己承担，变啦对用户不承担任何责任。</b>
<b>（4）变啦不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</b>
<b>（5）用户同意保障和维护变啦及其他用户的利益，由于用户登录网站内容违法、不真实、不正当、侵犯第三方合法权益，或用户违反本协议项的任何条款而给变啦或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。</b>

<dt class="dt"><b>13、法律及其他</b></dt>
<p>（1）本服务协议执行过程中所产生的任何问题变啦和用户都将友好协商解决。</p>
<p>（2）用户和变啦一致同意，与本协议的成立、生效、履行及其他方面相关的一切争议以及与使用糖吧APP服务或产品相关的一切争议，均提交被告所在地人民法院以诉讼方式解决；且胜诉方有权要求对方承担与诉讼相关的合理的交通、住宿费用。</p>
<b>（3）用户同意，变啦所自行维护运营或者委托第三方维护的服务器内的数据库、数据可以在诉讼中作为证据使用，用户不得以该等数据库、数据为电子形式而否定其法律效力。同时，用户放弃要求变啦对该等数据库、数据的表现形式进行公证的要求。</b>
<p>（4）本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>

<b>糖吧APP相关声明版权及其修改权、更新权和最终解释权均属杭州变啦网络科技有限公司所有。</b>
                <!-- </dl> -->
                </div>



   <button  class="submit" @click="commit" >我已阅读并同意此协议和条款</button>

      </div>

</template>

<script>
import {getUrlParams,getNative,getUrlName,navigationHeightCallback} from '../../static/js/checkcode.js'
// import navheader from "./appheader.vue"
export default {
  name: 'disease',
  data () {
    return {
      msg: 'disease',
      isIphoneX:false
    }
  },
    // components:{
    // navheader
    // },
  methods: {
    commit:function(){
       app.native.cancelNativePage();
    }

  },
  created:function(){
    if(/iphone/gi.test(navigator.userAgent) && (screen.height == 812 && screen.width == 375)){
      this.isIphoneX=true;
    }


   }

}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
[v-cloak]{display: none;}
h1, h2 {
  font-weight: normal;
}
.hello{
  width: 100%;
  height: 100%;

}
.cont{
  width: 100%;
  overflow-y: scroll;
  -webkit-overflow-scrolling:touch;
  margin: 0  auto ;
  margin-bottom: 0;
  padding-bottom: 0;
  text-align: left;
  word-break:break-all;
  line-height:1.5;padding:0 .266667rem;
  font-size: 14px;
  font-size:.373333rem;
}

.cont>dt {
  font-size: .426667rem;
}
.submit{
  display: block;
  width: 100%;
  height: 1.06667rem;
  line-height:  1.06667rem;
  background-color: #3296FA;
  color: #fff;
  border: 1px solid #3296FA;
  box-sizing: border-box;
  margin-top: 0px;
}
/* .flex{
   display:-webkit-box;display:-webkit-flex;display:-ms-flexbox;display:flex;
}
.flex-column{
   -webkit-box-orient:vertical;-webkit-flex-direction:column;-ms-flex-direction:column;flex-direction:column;
}
.justify-between {
  -webkit-box-pack:justify;-webkit-justify-content:space-between;-ms-flex-pack:justify;justify-content:space-between;
}
.flex1{
  -webkit-box-flex:1;
  -webkit-flex:1;
  -ms-flex:1;
  flex:1;
} */

</style>
